## Plan for terraform
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`


**⚠️ &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
lambda.tf
```




```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_function_url.share_files_securely_url_alias will be created
  + resource "aws_lambda_function_url" "share_files_securely_url_alias" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "share_files_securely:latest"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + url_id             = (known after apply)

      + cors {
          + allow_credentials = true
          + allow_methods     = [
              + "*",
            ]
          + allow_origins     = [
              + "*",
            ]
          + max_age           = 86400
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.share_files_securely_bucket.aws_s3_bucket.this,
  on .terraform/modules/share_files_securely_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 9 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.share_files_securely"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]
WARN - plan.json - main - Missing Common Tags: ["module.s3_scan_objects.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.s3_scan_objects.aws_iam_role.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.s3_scan_objects_dev.aws_iam_policy.s3_scan_object"]
WARN - plan.json - main - Missing Common Tags: ["module.s3_scan_objects_dev.aws_iam_role.s3_scan_object"]

28 tests, 17 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
